In [1]:
import pandas as pd

In [2]:
empty_df = pd.DataFrame()

In [3]:
print(empty_df)

Empty DataFrame
Columns: []
Index: []

In [4]:
continents_name = ['ASIA','AFRICA','SOUTH AMERICA','NORTH AMERICA','EUROPE','AUSTRALIA','ANTARCTICA']

In [6]:
name_df = pd.DataFrame(continents_name,columns=["Name"])

In [7]:
print(name_df)

            Name
0           ASIA
1         AFRICA
2  SOUTH AMERICA
3  NORTH AMERICA
4         EUROPE
5      AUSTRALIA
6     ANTARCTICA

In [8]:
continents_area = [44579000,30065000,17819000,24256000,9938000,7687000,13209000]

In [9]:
continents_area_msqkm = []

In [10]:
for i in continents_area:
    continents_area_msqkm.append(i/(10**6))

In [11]:
area_df = pd.DataFrame(continents_area_msqkm,columns=["Area(MSqkm)"])

In [12]:
area_df

   Area(MSqkm)
0       44.579
1       30.065
2       17.819
3       24.256
4        9.938
5        7.687
6       13.209

In [13]:
continents_name_area = list(zip(continents_name,continents_area_msqkm))

In [14]:
continents_name_area

[('ASIA', 44.579),
 ('AFRICA', 30.065),
 ('SOUTH AMERICA', 17.819),
 ('NORTH AMERICA', 24.256),
 ('EUROPE', 9.938),
 ('AUSTRALIA', 7.687),
 ('ANTARCTICA', 13.209)]

In [15]:
continents_name_area1 = pd.DataFrame(continents_name_area,columns=['Name','AREA(MSqkm)'])

In [16]:
continents_name_area1

            Name  AREA(MSqkm)
0           ASIA       44.579
1         AFRICA       30.065
2  SOUTH AMERICA       17.819
3  NORTH AMERICA       24.256
4         EUROPE        9.938
5      AUSTRALIA        7.687
6     ANTARCTICA       13.209

In [17]:
weather_data = pd.read_csv('weather_data.csv')
weather_data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [18]:
weather_data.shape

(6, 4)

In [19]:
rows,colums = weather_data.shape

In [20]:
rows

6

In [21]:
colums

4

In [22]:
weather_data.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [23]:
weather_data.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [24]:
weather_data.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [25]:
weather_data.tail(3)

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [27]:
weather_data[3:5]

        day  temperature  windspeed event
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [28]:
weather_data.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [29]:
weather_data.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [30]:
weather_data.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [31]:
weather_data['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [32]:
weather_data.windspeed

0    6
1    7
2    2
3    7
4    4
5    2
Name: windspeed, dtype: int64

In [34]:
weather_data['temperature'].max()

35

In [35]:
weather_data['temperature'].min()

24

In [37]:
weather_data.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [38]:
weather_data.describe(include = 'all')

             day  temperature  windspeed event
count          6     6.000000   6.000000     6
unique         6          NaN        NaN     3
top     1/5/2017          NaN        NaN  Rain
freq           1          NaN        NaN     2
mean         NaN    30.333333   4.666667   NaN
std          NaN     3.829708   2.338090   NaN
min          NaN    24.000000   2.000000   NaN
25%          NaN    28.750000   2.500000   NaN
50%          NaN    31.500000   5.000000   NaN
75%          NaN    32.000000   6.750000   NaN
max          NaN    35.000000   7.000000   NaN

In [39]:
weather_data.describe(exclude=None)

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000